# if ซ้อน if  คือมีเงื่อนไขซ้อนไปอีก
age=int(input("ป้อนอายุของคุณ : "))

if age<=15:
    if age==15:
        print("ม.3")
    elif age==14:
        print("ม.2")
    elif age==13:
        pass   #pass คือมีไว้เพื่อวางโครงสร้างของตัวโค้ด แต่ยังไม่ได้ระบุการทำงานอะไร ให้ผ่านไปก่อน ยังคิดไม่ออกว่าจะให้ทำอะไรก็ใส่ pass
               # ( ถ้าไม่ระบุโปรแกรมจะerror )
    else :
        print("ประถมศึกษา")
elif age>15 and age<=18 :
    print("ม.ปลาย")
else:
    print("มหาลัย")

print("จบโปรแกรม")