# Frozen set : ไม่สามารถ ลบ เพิ่มข้อมูล แก้ไข ได้เลย (แตกต่างจาก set ที่สามารถใช้คำสั่งเพิ่มได้)
# Froen set เหมาะสำหรับข้อมูลที่อยากให้คงที่เสมอ!!!

fruit=set(["มะม่วง","มะยม","มะนาว","มะปราง"])
fruit.add("ทุเรียน") # เพิ่มทุเรียนเข้าไปใน set
fruit.discard("มะนาว") # ลบมะนาวออก
print(fruit)  # {'ทุเรียน', 'มะปราง', 'มะม่วง', 'มะยม'}


# frozen set
fruit=frozenset(["มะม่วง","มะยม","มะนาว","มะปราง"])
print(fruit) # ถ้าใช้คำสั่ง เพิ่ม ลบ หรือ แก้ไขข้อมูล โปรแกรมจะ error ไม่รันโค้ดต่อ

for item in fruit:
    print("ข้อมูล =",item)