"""

 Set : สมาขิกซ้ำกันไม่ได้ และ ไม่สามารถแก้ไขข้อมูลสมาชิกได้ถ้าสร้าง set แล้ว แต่เพิ่มได้  ( List[] , Tuple() : สมาชิกซ้ำกันได้ )
 Set เขียนในูป { }
 Set การเรียงลำดับไม่แน่นอน(ถ้าใส่ซ้ำจะนับแค่1ตัว)  ( List , Tuple : เรียงลำดับจากซ้ายไปขวา) ** ไม่สามารถแสดง index(ตำแหน่ง) ข้อมูลได้ **

"""

# แบบปกติ
fruit ={"มะขาม","มะม่วง","มะยม",50,True}
print(fruit)

# เขียนแบบ constructor
lis = ["ปลาดุก","ปลาหมอ"]
fish=set(lis)
print(fish)

#  เพิ่มข้อมูลสมาชิก โดยคำสั่ง add
fruit.add("ทุเรียน")
fruit.add(3.14)
print(fruit)

# เพิ่มข้อมูลสมาชิกหลายๆตัว พร้อมกัน
lis=["ตะไคร้","โหระพา","ชะอม"]
fruit.update(lis)          # update : เพิ่มและอัพเดตข้อมูลในคราวเดียวกันพร้อมกัน  
# fruit.update(["ตะไคร้","โหระพา","ชะอม"]) 
print(fruit)

#Loop
for item in fruit:
    print("ข้อมูล :",item)

# แสดงจำนวนสมาขิกใน set
print(len(fruit))   # {True, 3.14, 'มะขาม', 'มะยม', 'โหระพา', 'ทุเรียน', 50, 'ชะอม', 'ตะไคร้', 'มะม่วง'}
# 10 ตัว

# check สมาชิก
if "มะเฟือง" in fruit:
    print("มี")
else:
    print("ไม่มี")


print("มะม่วง" in fruit)

# ลบสมาชิกใน set ใช้ remove , discard 
fruit.remove("ทุเรียน")
print(fruit)   # {True, 3.14, 'มะม่วง', 'ชะอม', 'ตะไคร้', 50, 'มะขาม', 'มะยม', 'โหระพา'}

fruit.discard("มะปราง")  # discard คือ จะลบเมื่อมีสมาชิกใน set จริงๆ ( ถ้าไม่มีโปรแกรมก็จะไม่ขึ้น error ยังรันได้ต่อ แนะนำให้ใช้!!!)
print(fruit)  # {True, 3.14, 'ชะอม', 'ตะไคร้', 'มะม่วง', 'โหระพา', 'มะขาม', 50, 'มะยม'}

# clear : ลบสมาชิกทั้งหมดใน set ( ไม่ลบตัวแปร )
fruit.clear()
print(fruit) # set()

# del : ลบสมาชิก ลบตัวแปร (เคลียmemory)
# del fruit
# print(fruit)

