# dictionary => key (การเข้าถึงข้อมูล) , value  (ค่าข้อมูล)
# สร้าง Dict ซ้อน Dict
market ={
    "ร้านป้าพร":{
        "name":"ป้าพร",
        "menu":["กระเพราไก่","ก๋วยเตี๋ยว"],
        "zone":"A"


    },
    "ร้านลุงป้อม":{
        "name":"น้าจ๊อบ",
        "menu":["มะม่วง","ทุเรียน"],
        "zone":"B"

    },
    "ร้านน้าใจ":{
        "name":"น้าใจ",
        "menu":["โค้ก","น้ำผลไม้"],
        "zone":"C"
    }
}

print(market["ร้านป้าพร"]["menu"]) # [key หลัก][keyย่อย]
# ['กระเพราไก่', 'ก๋วยเตี๋ยว']

# Check ว่ามีข้อมูลมั้ย
print("ก๋วยเตี๋ยว" in market["ร้านป้าพร"]["menu"])
# True

if "มะม่วง" in market["ร้านป้าพร"]["menu"]:
    print("มี")
else :
    print("ไม่มี")

