"""

open("ชื่อไฟล์","โหมด","การเข้ารหัส")   

# โหมด : รูปแบบการทำงานของตัวไฟล์ เช่น อ่านได้อย่างเดียว , เขียนได้มั้ย , อ่านและเขียนได้  
"r" = อ่านได้อย่างเดียว
"w" = เขียนได้อย่างเดียว  (สามารถสร้างไฟล์ขึ้นมาเองได้)
"a" = ต่อข้อความเข้าไปในไฟล์   ( append )
"x" = สร้างไฟล์ขึ้นมาใหม่
"t" = text file
"b" = binary file

# การเข้ารหัส : อ่านภาษาอื่นๆ เช่น ไทย อิ้ง และภาษาอื่นๆ ( ระบุก็ได้หรือไม่ระบุก็ได้ : อยากได้ภาษาอื่นๆนอกจากอิ้ง ก็ต้องระบุรหัส ) 

การเข้ารหัสภาษาไทย : encoding = "utf-8"

"""

try :
    fr = open("student.txt","r",encoding = "utf-8")
    print(fr.read())   # .read()  : อ่านข้อความในไฟล์     # Hello Text File.   # .read(i)  iคือจำนวนตัวอักษรที่อยากได้ให้แสดง
    fr.close()              # .close : เมื่อดำเนินการกับตัวไฟล์เสร็จต้องปิดทุกครั้ง
except FileNotFoundError:     # FileNotFoundError : หาไฟล์ไม่เจอ
    print("หาไฟล์ไม่เจอ")
